{"categories":["womens","tops","new arrivals","pants","mens","jackets","accessories","shorts"],"__N_SSG":true,"pageProps":{"inventory":[{"categories":["womens","tops","new arrivals"],"name":"FrostChill Snow Tee","slug":"frostchill-snow-tee-womens","price":"49.99","image":"/products/frostchill-snow-tee-womens.png","description":"Take on the slopes in style with our FrostChill Snow Tee. Designed with snow sports in mind, this sports top is made from fast-drying, functional fabric that will keep you comfortable and dry no matter how intense your activity gets. With short raglan sleeves and visible seams, the FrostChill Snow Tee is as stylish as it is functional. The comfortable, loose fit provides freedom of movement and ensures that you can move easily in any direction. \n\nThe FrostChill Snow Tee is versatile enough to wear for any activity, whether you're hitting the slopes, hiking, running, or working out at the gym. Its fast-drying fabric helps wick away moisture to keep you cool and comfortable during even the most strenuous activities. Available in a range of sizes, the FrostChill Snow Tee is the perfect snow sports top for women who want to perform at their best.","brand":"Frost Fit","currentInventory":8,"tags":["snow sports top","fast-drying","functional fabric","short raglan sleeves","visible seams","loose fit","freedom of movement","versatile"],"id":"a0afe171-d3db-4f1b-83a8-16f082730288"},{"categories":["womens","pants","new arrivals"],"name":"SereneFlow Yoga Pants","slug":"sereneflow-yoga-pants","price":"69.99","image":"/products/sereneflow-yoga-pants.png","description":"Achieve the perfect balance of comfort and style with our SereneFlow Yoga Pants. Made from fast-drying fabric, these pants provide excellent moisture-wicking properties, keeping you dry and comfortable during your yoga sessions. The high waistband provides ample support and coverage, while the side pockets are perfect for holding your phone or other essentials.\n\nThe pants have a flattering design with a slim fit that hugs your curves in all the right places, providing a comfortable fit and freedom of movement. The high waistband helps to keep the pants securely in place, so you can focus on your yoga poses without any distractions. With its sleek and modern design, our SereneFlow Yoga Pants are perfect for any activity, from yoga to Pilates, stretching, or simply lounging around. They are versatile and stylish, making them perfect for both indoor and outdoor activities. So why wait? Get your hands on these amazing Women's Yoga Pants today and experience the ultimate in comfort and style!","brand":"Frost Fit","currentInventory":8,"tags":["women's yoga pants","fast-drying","high waistband","side pockets","moisture-wicking","slim fit","flattering design","versatile"],"id":"10ef14ad-d84c-49dd-93b0-2d8eb795320c"},{"categories":["new arrivals","mens","jackets"],"name":"Arctic Breeze Puffer Jacket","slug":"arctic-breeze-puffer-jacket","image":"/products/arctic-breeze-puffer-jacket.png","price":"139.99","description":"Introducing the Arctic Breeze Puffer Jacket from Frost Fit, the ultimate combination of style and warmth. Made from high-quality materials and designed with attention to detail, this jacket is the perfect addition to your cold weather wardrobe.\n\nThe padded short jacket is not only stylish, but also practical. The quilted lining provides extra warmth, ensuring that you stay cozy and comfortable even in the coldest temperatures. The jersey-lined hood and stand-up collar with a drawstring provide additional protection from the elements, keeping your head and neck warm and dry.\n\nThe zip-down front allows for easy on and off, while the flap side pockets with press-stud provide ample storage space for your essentials. There's even one inner pocket for added convenience, so you can keep your valuables close at hand. The ribbing at the cuffs and hem ensures a comfortable and snug fit, keeping out the cold air and trapping in the warmth. The short length of the jacket is perfect for layering, so you can wear it over your favorite winter sweater or under a heavier coat for added insulation.\n\nThe Arctic Breeze Puffer Jacket is available in a range of colors to suit your personal style. Whether you're hitting the slopes, going for a walk in the park, or just running errands around town, this jacket will keep you warm and stylish all winter long.","brand":"Frost Fit","currentInventory":10,"tags":["puffer jacket","men's jacket","short jacket","hooded jacket","lightweight","warm","zippered front","side pockets","ribbed cuffs","stylish"],"id":"8946312f-ef3a-4af2-995a-221f232c6c88"},{"categories":["new arrivals","mens","accessories"],"name":"Summit Outdoorsman Scarf","slug":"summit-outdoorsman-scarf","price":"99.99","image":"/products/summit-outdoorsman-scarf.png","description":"Introducing the ultimate luxury outdoorsman scarf, the Summit Stripes. Crafted from the finest materials, this scarf offers unparalleled comfort and warmth, perfect for those chilly days in the great outdoors. The design is Oxonian with just enough vox populi, making it both timeless and modern. The bold stripes and intricate stitching demand respect and attention, and you'll feel confident and unstoppable when you wear it. It's the perfect accessory for the man who requires few provisions when he heads off to wilder places, like a cabin with a view of a lake and a moon that looks like you could hang it on the wall. The Summit Stripes Luxury Outdoorsman Scarf is a true reflection of your adventurous spirit. Order yours today and let the adventures begin.","brand":"Summit Stripes","currentInventory":10,"tags":["luxury scarf","outdoorsman accessory","bold colors","unparalleled comfort","warmth","modern design"],"id":"89b7e5ff-4f3f-4283-85dc-d614f76482b5"},{"categories":["womens","jackets","new arrivals"],"name":"IceFlow Knit Sports Jacket","slug":"iceflow-knit-sports-jacket","price":"88.99","image":"/products/iceflow-knit-sports-jacket.png","description":"Introducing the IceFlow Knit Sports Jacket, the perfect blend of style and performance. This jacket is designed for the modern woman who demands both comfort and fashion in her active wear. The jacquard-knit construction provides maximum flexibility and comfort, while the stylish design ensures you stand out from the crowd.\n\nThe IceFlow Knit Sports Jacket is perfect for any outdoor activity, whether it's a morning run or an evening hike. The lightweight material keeps you cool and comfortable, while the snug fit ensures you stay protected from the elements. The jacket comes with a full-length zipper for easy on-and-off access, and two side pockets for carrying your essentials.\n\nThis jacket is part of our new arrivals collection and is available exclusively for women. It is part of the Jackets category and comes with a price of $88.99. The jacket features the IceFlow logo and is available in limited stock, with only 4 units currently available. Order now to add this stylish and functional sports jacket to your wardrobe!","brand":"IceFlow","currentInventory":4,"tags":["sports jacket","women's jacket","jacquard-knit","lightweight","flexible","stylish design","full-length zipper","side pockets","limited stock","outdoor activities"],"id":"472017b4-76c9-4be4-8774-2404281e031c"}],"title":"new arrivals"}}