{"categories":["womens","tops","new arrivals","pants","mens","shorts","accessories","jackets","hats"],"__N_SSG":true,"pageProps":{"inventory":[{"categories":["new arrivals","mens","accessories"],"name":"Summit Outdoorsman Scarf","slug":"summit-outdoorsman-scarf","price":"99.99","image":"/products/summit-outdoorsman-scarf.png","description":"Introducing the ultimate luxury outdoorsman scarf, the Summit Stripes. Crafted from the finest materials, this scarf offers unparalleled comfort and warmth, perfect for those chilly days in the great outdoors. The design is Oxonian with just enough vox populi, making it both timeless and modern. The bold stripes and intricate stitching demand respect and attention, and you'll feel confident and unstoppable when you wear it. It's the perfect accessory for the man who requires few provisions when he heads off to wilder places, like a cabin with a view of a lake and a moon that looks like you could hang it on the wall. The Summit Stripes Luxury Outdoorsman Scarf is a true reflection of your adventurous spirit. Order yours today and let the adventures begin.","brand":"Summit Stripes","currentInventory":10,"tags":["luxury scarf","outdoorsman accessory","bold colors","unparalleled comfort","warmth","modern design"],"id":"80b0967a-5a25-4a4c-a4e1-7ea395df759c"},{"categories":["accessories","hats","mens"],"name":"Arctic Chill Mens Beanie","slug":"arctic-chill-mens-beanie","image":"/products/arctic-chill-mens-beanie.png","price":"29.99","description":"Stay warm and stylish with the Arctic Chill Unisex Beanie from Frost Fit. Made from high-quality, soft wool, this beanie is perfect for winter sports or casual wear. The snug fit and thick knit provide maximum warmth, while the Frost Fit logo adds a touch of style. Available in a range of colors, this beanie is a must-have accessory for any cold weather outfit.","brand":"Frost Fit","currentInventory":10,"tags":["beanie","wool","winter sports","casual wear","warmth","Frost Fit logo","color options"],"id":"caf81007-553f-41d7-a70d-ec539d6feef5"}],"title":"accessories"}}