{"categories":["womens","tops","new arrivals","pants","mens","jackets","accessories","shorts"],"__N_SSG":true,"pageProps":{"inventory":[{"categories":["accessories"],"name":"Arctic Chill Mens Beanie","slug":"arctic-chill-mens-beanie","image":"/products/arctic-chill-mens-beanie.png","price":"29.99","description":"Stay warm and stylish with the Arctic Chill Unisex Beanie from Frost Fit. Made from high-quality, soft wool, this beanie is perfect for winter sports or casual wear. The snug fit and thick knit provide maximum warmth, while the Frost Fit logo adds a touch of style. Available in a range of colors, this beanie is a must-have accessory for any cold weather outfit.","brand":"Frost Fit","currentInventory":10,"tags":["beanie","wool","winter sports","casual wear","warmth","Frost Fit logo","color options"],"id":"55a09589-b04f-47eb-8206-561cf9d135b7"},{"categories":["new arrivals","mens","accessories"],"name":"Summit Outdoorsman Scarf","slug":"summit-outdoorsman-scarf","price":"99.99","image":"/products/summit-outdoorsman-scarf.png","description":"Introducing the ultimate luxury outdoorsman scarf, the Summit Stripes. Crafted from the finest materials, this scarf offers unparalleled comfort and warmth, perfect for those chilly days in the great outdoors. The design is Oxonian with just enough vox populi, making it both timeless and modern. The bold stripes and intricate stitching demand respect and attention, and you'll feel confident and unstoppable when you wear it. It's the perfect accessory for the man who requires few provisions when he heads off to wilder places, like a cabin with a view of a lake and a moon that looks like you could hang it on the wall. The Summit Stripes Luxury Outdoorsman Scarf is a true reflection of your adventurous spirit. Order yours today and let the adventures begin.","brand":"Summit Stripes","currentInventory":10,"tags":["luxury scarf","outdoorsman accessory","bold colors","unparalleled comfort","warmth","modern design"],"id":"74d5ea92-ebdb-4d46-9b7e-c7aa3931cc8e"},{"categories":["accessories"],"name":"Skyline Aviator Sunglasses","slug":"skyline-aviator-sunglasses","image":"/products/skyline-aviator-sunglasses.png","price":"99.99","description":"Take your style to new heights with our Skyline Aviator Sunglasses. With a classic design inspired by the golden age of aviation, these sunglasses are the perfect accessory for any adventure. The high-quality metal frames are durable and lightweight, with adjustable nose pads for a comfortable fit. The polarized lenses provide superior glare reduction and 100% UV protection, making them perfect for outdoor activities.\n\nThe Skyline Aviator Sunglasses are designed to make a statement, with a bold and iconic look that is sure to turn heads. The sleek metal frames and double bridge design provide a timeless look that never goes out of style. Available in a range of lens colors to suit your personal style, these sunglasses are the perfect addition to any outfit.\n\nWhether you're flying high in the cockpit, hitting the beach, or cruising around town, the Skyline Aviator Sunglasses are the perfect companion. With attention to detail and a focus on both style and functionality, these sunglasses are built to last and designed to impress.","brand":"Frost Fit","currentInventory":8,"tags":["aviator sunglasses","accessories","sunglasses","metal frames","adjustable nose pads","polarized lenses","glare reduction","100% UV protection","bold design","double bridge","timeless look","range of lens colors","durability","functionality"],"id":"2b7cf446-3be9-4979-a5aa-211da0461332"},{"categories":["womens","accessories"],"name":"Powder Peak Women's Beanie","slug":"powder-peak-womens-beanie","image":"/products/powder-peak-womens-beanie.png","price":"29.99","description":"Stay warm and stylish on the slopes with our Powder Peak Women's Beanie. Made from soft and cozy wool-blend yarn, this beanie features a classic cable-knit pattern with a pom-pom on top. The ribbed edge ensures a snug fit that will keep you warm and comfortable all day long.\n\nThe Powder Peak Women's Beanie is designed to keep you warm and stylish in any winter activity, from skiing to snowshoeing to simply enjoying a walk in the snow. With a classic and timeless design, this beanie is the perfect addition to any winter wardrobe. Available in a range of colors to suit your personal style, this beanie is the perfect gift for any winter sports enthusiast.\n\nCrafted with care and attention to detail, the Powder Peak Women's Beanie is a high-quality product that will last season after season. It is easy to care for and will maintain its shape and color even after repeated use.","brand":"Frost Fit","currentInventory":20,"tags":["women's beanie","accessories","womens","wool-blend yarn","cable-knit pattern","pom-pom","ribbed edge","warm and comfortable","timeless design","range of colors","winter sports","high-quality","durable","easy to care for"],"id":"3131720f-b779-44fd-8f46-0d122bfb83a9"}],"title":"accessories"}}