{"categories":["womens","tops","new arrivals","pants","mens","jackets","accessories","shorts"],"__N_SSG":true,"pageProps":{"inventory":[{"categories":["new arrivals","mens","jackets"],"name":"Arctic Breeze Puffer Jacket","slug":"arctic-breeze-puffer-jacket","image":"/products/arctic-breeze-puffer-jacket.png","price":"139.99","description":"Introducing the Arctic Breeze Puffer Jacket from Frost Fit, the ultimate combination of style and warmth. Made from high-quality materials and designed with attention to detail, this jacket is the perfect addition to your cold weather wardrobe.\n\nThe padded short jacket is not only stylish, but also practical. The quilted lining provides extra warmth, ensuring that you stay cozy and comfortable even in the coldest temperatures. The jersey-lined hood and stand-up collar with a drawstring provide additional protection from the elements, keeping your head and neck warm and dry.\n\nThe zip-down front allows for easy on and off, while the flap side pockets with press-stud provide ample storage space for your essentials. There's even one inner pocket for added convenience, so you can keep your valuables close at hand. The ribbing at the cuffs and hem ensures a comfortable and snug fit, keeping out the cold air and trapping in the warmth. The short length of the jacket is perfect for layering, so you can wear it over your favorite winter sweater or under a heavier coat for added insulation.\n\nThe Arctic Breeze Puffer Jacket is available in a range of colors to suit your personal style. Whether you're hitting the slopes, going for a walk in the park, or just running errands around town, this jacket will keep you warm and stylish all winter long.","brand":"Frost Fit","currentInventory":10,"tags":["puffer jacket","men's jacket","short jacket","hooded jacket","lightweight","warm","zippered front","side pockets","ribbed cuffs","stylish"],"id":"07247b2d-1092-4410-a2fe-2cba877267bd"},{"categories":["womens","jackets"],"name":"Zephyr Windbreaker","slug":"zephyr-windbreaker-womens","price":"79.99","image":"/products/zephyr-windbreaker-womens.png","description":"Stay comfortable and stylish during your workouts with our Zephyr Windbreaker. Made from lightweight and windproof fabric, this jacket provides maximum protection against the elements while you work up a sweat. The stand-up collar and zippered pockets give the jacket a sleek and modern look that is perfect for any active woman. The high-quality fabric is fast-drying, so you don't have to worry about getting wet and uncomfortable during your workout. The jacket also has excellent breathability, ensuring that you stay cool and comfortable throughout your exercise routine.\n\nThe jacket has a slim fit design with a flattering shape that hugs your curves in all the right places, providing a comfortable fit and freedom of movement. The high waistband helps to keep the jacket securely in place, so you can focus on your workout without any distractions. With its sleek and modern design, our Zephyr Windbreaker is perfect for any activity, from running to hiking, cycling, or simply hitting the gym. It is versatile and stylish, making it perfect for both indoor and outdoor activities. So why wait? Get your hands on this amazing Women's Athletic Jacket today and take your workout to the next level!","brand":"Frost Fit","currentInventory":5,"tags":["women's athletic jacket","windbreaker","lightweight","zippered pockets","stand-up collar","fast-drying","breathable","slim fit","high waistband","versatile"],"id":"686a4ff3-caa3-480b-a86c-dd77187dcd24"},{"categories":["womens","jackets","new arrivals"],"name":"IceFlow Knit Sports Jacket","slug":"iceflow-knit-sports-jacket","price":"88.99","image":"/products/iceflow-knit-sports-jacket.png","description":"Introducing the IceFlow Knit Sports Jacket, the perfect blend of style and performance. This jacket is designed for the modern woman who demands both comfort and fashion in her active wear. The jacquard-knit construction provides maximum flexibility and comfort, while the stylish design ensures you stand out from the crowd.\n\nThe IceFlow Knit Sports Jacket is perfect for any outdoor activity, whether it's a morning run or an evening hike. The lightweight material keeps you cool and comfortable, while the snug fit ensures you stay protected from the elements. The jacket comes with a full-length zipper for easy on-and-off access, and two side pockets for carrying your essentials.\n\nThis jacket is part of our new arrivals collection and is available exclusively for women. It is part of the Jackets category and comes with a price of $88.99. The jacket features the IceFlow logo and is available in limited stock, with only 4 units currently available. Order now to add this stylish and functional sports jacket to your wardrobe!","brand":"IceFlow","currentInventory":4,"tags":["sports jacket","women's jacket","jacquard-knit","lightweight","flexible","stylish design","full-length zipper","side pockets","limited stock","outdoor activities"],"id":"dbcf62b7-55fe-4d59-ad65-bd555650cd5f"},{"categories":["womens","jackets"],"name":"Breezeshield Sports Jacket","slug":"breezeshield-sports-jacket","price":"67.99","image":"/products/breezeshield-sports-jacket.png","description":"BreezeShield Sports Jacket is a perfect combination of style and function that will keep you looking great and feeling comfortable during your workouts. Made from lightweight and windproof fabric, this jacket is designed to provide you with maximum protection against the elements while you work up a sweat. Featuring a stand-up collar and zippered pockets, this jacket has a sleek and modern look that is perfect for any active woman. The high-quality fabric is fast-drying, so you don't have to worry about getting wet and uncomfortable during your workout. The jacket also has excellent breathability, ensuring that you stay cool and comfortable throughout your exercise routine.\n\nThe jacket has a slim fit design with a flattering shape that hugs your curves in all the right places, providing a comfortable fit and freedom of movement. The high waistband helps to keep the jacket securely in place, so you can focus on your workout without any distractions. With its sleek and modern design, our Women's Athletic Jacket is perfect for any activity, from running to hiking, cycling, or simply hitting the gym. It is versatile and stylish, making it perfect for both indoor and outdoor activities. So why wait? Get your hands on this amazing Women's Athletic Jacket today and take your workout to the next level!","brand":"Breezeshield","currentInventory":4,"tags":["sports jacket","women's jacket","windproof","lightweight","fast-drying","breathable","slim fit","high waistband","versatile","outdoor activities"],"id":"9069d102-85c0-45a0-b655-667a4ad59970"},{"categories":["womens","jackets"],"name":"Arctic Breeze Puffer Jacket for Women","slug":"arctic-breeze-puffer-jacket-for-women","image":"/products/arctic-breeze-puffer-jacket-for-women.png","price":"139.99","description":"Stay warm and stylish in this Women's Arctic Breeze Puffer Jacket, designed to fit the female form perfectly. The padded short jacket features a jersey-lined hood and stand-up collar with a drawstring, ensuring you're ready for any weather. The zip-down front, flap side pockets with press-stud, and one inner pocket provide ample storage space. Ribbing at the cuffs and hem ensures a comfortable and snug fit. The quilted lining provides extra warmth, making this jacket perfect for colder weather.\n\nWhether you're going for a walk in the park, running errands, or hitting the slopes, this jacket will keep you warm and looking great. The short length of the jacket makes it perfect for layering, so you can wear it over your favorite winter sweater or under a heavier coat for added insulation. The Arctic Breeze Puffer Jacket for Women is available in a range of colors to suit your personal style, and is made from high-quality materials that are built to last. With attention to detail and a focus on both style and functionality, this jacket is the perfect addition to any cold weather wardrobe.","brand":"Frost Fit","currentInventory":8,"tags":["puffer jacket","women's jacket","short jacket","hooded jacket","lightweight","warm","zippered front","side pockets","ribbed cuffs","stylish"],"id":"de94a857-c4ad-4a3e-9d68-84bf564a706e"}],"title":"jackets"}}